marshallma21/AUTOSAR_SampleProject_S32K144/plugins/Mcu_TS_T40D2M10I1R0/include/Reg_eSys_SIM.h
#define SIM_FTM4CLKSEL_TCLK0_PIN_U32        ((uint32)0x00000000U)
#define SIM_FTM4CLKSEL_TCLK1_PIN_U32        ((uint32)0x00010000U)
#define SIM_FTM4CLKSEL_TCLK2_PIN_U32        ((uint32)0x00020000U)
#define SIM_FTM4CLKSEL_NO_CLOCK_U32         ((uint32)0x00030000U)

#define SIM_FTM3_FLT0_PIN_FLT0_U32          ((uint32)0x00000000U)
#define SIM_TRGMUX_FTM3_OUT_FLT0_U32        ((uint32)0x00001000U)

#define SIM_FTM3_FLT1_PIN_FLT1_U32          ((uint32)0x00000000U)
#define SIM_TRGMUX_FTM3_OUT_FLT1_U32        ((uint32)0x00002000U)

#define SIM_FTM3_FLT2_PIN_FLT2_U32          ((uint32)0x00000000U)
#define SIM_TRGMUX_FTM3_OUT_FLT2_U32        ((uint32)0x00004000U)

#define SIM_FTM2_FLT0_PIN_FLT0_U32          ((uint32)0x00000000U)
#define SIM_TRGMUX_FTM2_OUT_FLT0_U32        ((uint32)0x00000100U)

#define SIM_FTM2_FLT1_PIN_FLT1_U32          ((uint32)0x00000000U)
#define SIM_TRGMUX_FTM2_OUT_FLT1_U32        ((uint32)0x00000200U)

#define SIM_FTM2_FLT2_PIN_FLT2_U32          ((uint32)0x00000000U)
#define SIM_TRGMUX_FTM2_OUT_FLT2_U32        ((uint32)0x00000400U)

#define SIM_FTM1_FLT0_PIN_FLT0_U32          ((uint32)0x00000000U)
#define SIM_TRGMUX_FTM1_OUT_FLT0_U32        ((uint32)0x00000010U)

#define SIM_FTM1_FLT1_PIN_FLT1_U32          ((uint32)0x00000000U)
#define SIM_TRGMUX_FTM1_OUT_FLT1_U32        ((uint32)0x00000020U)

#define SIM_FTM1_FLT2_PIN_FLT2_U32          ((uint32)0x00000000U)
#define SIM_TRGMUX_FTM1_OUT_FLT2_U32        ((uint32)0x00000040U)

#define SIM_FTM0_FLT0_PIN_FLT0_U32          ((uint32)0x00000000U)
#define SIM_TRGMUX_FTM0_OUT_FLT0_U32        ((uint32)0x00000001U)

#define SIM_FTM0_FLT1_PIN_FLT1_U32          ((uint32)0x00000000U)
#define SIM_TRGMUX_FTM0_OUT_FLT1_U32        ((uint32)0x00000002U)

#define SIM_FTM0_FLT2_PIN_FLT2_U32          ((uint32)0x00000000U)
#define SIM_TRGMUX_FTM0_OUT_FLT2_U32        ((uint32)0x00000004U)

/****************************************************/
/***              SIM_LPOCLKS                     ***/
/****************************************************/
#define SIM_LPOCLKS_RWBITS_MASK32           ((uint32)0x0000003FU)

#define SIM_LPOCLKS_RTCCLKSEL_MASK32        ((uint32)0x00000030U)
#define SIM_LPOCLKS_LPOCLKSEL_MASK32        ((uint32)0x0000000CU)
#define SIM_LPOCLKS_LPO32KCLKEN_MASK32      ((uint32)0x00000002U)
#define SIM_LPOCLKS_LPO1KCLKEN_MASK32       ((uint32)0x00000001U)

#define SIM_RTCCLKSEL_SOSCDIV1_CLK_U32      ((uint32)0x00000000U)
#define SIM_RTCCLKSEL_LPO_CLK_32K_U32       ((uint32)0x00000010U)
#define SIM_RTCCLKSEL_RTC_CLKIN_CLK_U32     ((uint32)0x00000020U)
#define SIM_RTCCLKSEL_FIRCDIV1_CLK_U32      ((uint32)0x00000030U)

#define SIM_LPOCLKSEL_LPO_CLK_128K_U32    ((uint32)0x00000000U)
#define SIM_LPOCLKSEL_NO_CLOCK_U32        ((uint32)0x00000004U)
#define SIM_LPOCLKSEL_LPO_CLK_32K_U32     ((uint32)0x00000008U)
#define SIM_LPOCLKSEL_LPO_CLK_1K_U32      ((uint32)0x0000000CU)

#define SIM_DISABLE_32KHZ_LPO_CLK_U32       ((uint32)0x00000000U)
#define SIM_ENABLE_32KHZ_LPO_CLK_U32        (SIM_LPOCLKS_LPO32KCLKEN_MASK32)

#define SIM_DISABLE_1KHZ_LPO_CLK_U32        ((uint32)0x00000000U)
#define SIM_ENABLE_1KHZ_LPO_CLK_U32         (SIM_LPOCLKS_LPO1KCLKEN_MASK32)

/****************************************************/
/***              SIM_ADCOPT                      ***/
/****************************************************/
#define SIM_ADCOPT_RWBITS_MASK32            ((uint32)0x00003F3FU)

#define SIM_ADCOPT_ADC1PRETRGSEL_MASK32     ((uint32)0x00003000U)
#define SIM_ADCOPT_ADC1SWPRETRG_MASK32      ((uint32)0x00000E00U)
#define SIM_ADCOPT_ADC1TRGSEL_MASK32        ((uint32)0x00000100U)

#define SIM_ADCOPT_ADC0PRETRGSEL_MASK32     ((uint32)0x00000030U)
#define SIM_ADCOPT_ADC0SWPRETRG_MASK32      ((uint32)0x0000000EU)
#define SIM_ADCOPT_ADC0TRGSEL_MASK32        ((uint32)0x00000001U)

#define SIM_ADC1_PDB_PRE_TRIGGER_U32        ((uint32)0x00000000U)
#define SIM_ADC1_TRGMUX_PRE_TRIGGER_U32     ((uint32)0x00001000U)
#define SIM_ADC1_SOFTWARE_PRE_TRIGGER_U32   ((uint32)0x00002000U)

#define SIM_ADC1_SW_PRE_TRIGGER_DISABLE_U32 ((uint32)0x00000000U)
#define SIM_ADC1_SW_PRE_TRIGGER_0_U32       ((uint32)0x00000800U)
#define SIM_ADC1_SW_PRE_TRIGGER_1_U32       ((uint32)0x00000A00U)
#define SIM_ADC1_SW_PRE_TRIGGER_2_U32       ((uint32)0x00000C00U)
#define SIM_ADC1_SW_PRE_TRIGGER_3_U32       ((uint32)0x00000E00U)

#define SIM_ADC1_PDB_TRIGGER_SOURCE_U32     ((uint32)0x00000000U)
#define SIM_ADC1_TRGMUX_TRIGGER_SOURCE_U32  (SIM_ADCOPT_ADC1TRGSEL_MASK32)

#define SIM_ADC0_PDB_PRE_TRIGGER_U32        ((uint32)0x00000000U)
#define SIM_ADC0_TRGMUX_PRE_TRIGGER_U32     ((uint32)0x00000010U)
#define SIM_ADC0_SOFTWARE_PRE_TRIGGER_U32   ((uint32)0x00000020U)

#define SIM_ADC0_SW_PRE_TRIGGER_DISABLE_U32 ((uint32)0x00000000U)
#define SIM_ADC0_SW_PRE_TRIGGER_0_U32       ((uint32)0x00000008U)
#define SIM_ADC0_SW_PRE_TRIGGER_1_U32       ((uint32)0x0000000AU)
#define SIM_ADC0_SW_PRE_TRIGGER_2_U32       ((uint32)0x0000000CU)
#define SIM_ADC0_SW_PRE_TRIGGER_3_U32       ((uint32)0x0000000EU)

#define SIM_ADC0_PDB_TRIGGER_SOURCE_U32     ((uint32)0x00000000U)
#define SIM_ADC0_TRGMUX_TRIGGER_SOURCE_U32  (SIM_ADCOPT_ADC0TRGSEL_MASK32)

/****************************************************/
/***              SIM_FTMOPT1                     ***/
/****************************************************/
#define SIM_FTMOPT1_RWBITS_MASK32           ((uint32)0xFFFFF9FFU)

#define SIM_FTMOPT1_FTM3OUTSEL_MASK32       ((uint32)0xFF000000U)
#define SIM_FTMOPT1_FTM3OUTSEL_SHIFT32      ((uint32)24U)
#define SIM_FTMOPT1_FTM0OUTSEL_MASK32       ((uint32)0x00FF0000U)
#define SIM_FTMOPT1_FTM0OUTSEL_SHIFT32      ((uint32)16U)
#define SIM_FTMOPT1_FTMGLDOK_MASK32         ((uint32)0x00008000U)
#define SIM_FTMOPT1_FTM7SYNCBIT_MASK32      ((uint32)0x00004000U)
#define SIM_FTMOPT1_FTM6SYNCBIT_MASK32      ((uint32)0x00002000U)
#define SIM_FTMOPT1_FTM5SYNCBIT_MASK32      ((uint32)0x00001000U)
#define SIM_FTMOPT1_FTM4SYNCBIT_MASK32      ((uint32)0x00000800U)
#define SIM_FTMOPT1_FTM2CH1SEL_MASK32       ((uint32)0x00000100U)
#define SIM_FTMOPT1_FTM2CH0SEL_MASK32       ((uint32)0x000000C0U)
#define SIM_FTMOPT1_FTM1CH0SEL_MASK32       ((uint32)0x00000030U)
#define SIM_FTMOPT1_FTM3SYNCBIT_MASK32      ((uint32)0x00000008U)
#define SIM_FTMOPT1_FTM2SYNCBIT_MASK32      ((uint32)0x00000004U)
#define SIM_FTMOPT1_FTM1SYNCBIT_MASK32      ((uint32)0x00000002U)
#define SIM_FTMOPT1_FTM0SYNCBIT_MASK32      ((uint32)0x00000001U)

#define SIM_MODULATION_WITH_FTMX_CH0_U32    ((uint32)0x00000001U)
#define SIM_MODULATION_WITH_FTMX_CH1_U32    ((uint32)0x00000002U)
#define SIM_MODULATION_WITH_FTMX_CH2_U32    ((uint32)0x00000004U)
#define SIM_MODULATION_WITH_FTMX_CH3_U32    ((uint32)0x00000008U)
#define SIM_MODULATION_WITH_FTMX_CH4_U32    ((uint32)0x00000010U)
#define SIM_MODULATION_WITH_FTMX_CH5_U32    ((uint32)0x00000020U)
#define SIM_MODULATION_WITH_FTMX_CH6_U32    ((uint32)0x00000040U)
#define SIM_MODULATION_WITH_FTMX_CH7_U32    ((uint32)0x00000080U)

#define SIM_NO_MODULATION_FOR_FTMX_CH_U32   ((uint32)0x00000000U)

